Catalogs/ТелВнешние.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ТелВнешние</Name>
			<Comment>Внешние телефоны</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сервер</Name>
					<Comment>Сервер, на который поступает данный номер</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ТелСерверы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодГорода</Name>
					<Comment>Телефонный код города</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Провайдер</Name>
					<Comment>Провайдер телефонного номера</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Провайдеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Comment>Сведения о предназначении номера</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>80</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтактЦентр</Name>
					<Comment>Контакт-центр для обработки непринятых звонков</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.КонтактЦентры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегдаИспользоватьЭтотКЦ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕстьИсходящие</Name>
					<Comment>Телефон может использоваться для совершения исходящих вызовов</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1000</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Почта</Name>
					<Comment>Адрес эл. почты уведомления о пропущенном</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>128</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архивный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Варианты</Name>
					<Comment>Варианты написания телефонного номера</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Код</Name>
							<Comment>Вариант написания номера</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>12</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Распределение</Name>
					<Comment>Распределение трафика по очередям</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>КонтактЦентр</Name>
							<Comment>Контакт-центр получивший трафик с номера</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактЦентры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Очередь</Name>
							<Comment>Рекомендованная очередь</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.ТелОчереди</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТелВнешние/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ,СтандартнаяОбработка)

// Если объект не новый, то проверим есть ли у него подчиненные элементы
// Если подчиненные элементы найдены, значит этот номер является пилотирующим для телефонной серии
// Скроем группу "Родитель", т.к. у самостоятельного номера Родителя быть не может
//-------------------------------------------------------------------------------------------------
	Если (ЗначениеЗаполнено(Объект.Ссылка)) Тогда
		ТекстЗапроса = "
		|SELECT	Код
		|FROM	Справочник.ТелВнешние
		|WHERE	(Родитель = &ЭтотОбъект)
		|ORDER	BY Код";

		Запрос = Новый Запрос;
		Запрос.Текст = ТекстЗапроса;
		Запрос.УстановитьПараметр("ЭтотОбъект",Объект.Ссылка);
		РезультатМассив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Код");

		ЭтаФорма.СписокПодчиненных.Очистить();
		ЭтаФорма.СписокПодчиненных.ЗагрузитьЗначения(РезультатМассив);
		Элементы.ГруппаРодитель.Видимость = (ЭтаФорма.СписокПодчиненных.Количество() = 0);

// Перенесем ТЧ "Варианты" с вариантами написания номера в список значений
//-------------------------------------------------------------------------------------------------
		ЭтаФорма.СписокВариантов.Очистить();
		ЭтаФорма.СписокВариантов.ЗагрузитьЗначения(Объект.Варианты.Выгрузить().ВыгрузитьКолонку("Код"));
	КонецЕсли;

// Настроим "СписокВариантов" на ввод только строк
//-------------------------------------------------------------------------------------------------
	КвалификаторНомера = Новый КвалификаторыСтроки(11,ДопустимаяДлина.Переменная);
	ЭтаФорма.СписокВариантов.ТипЗначения = Новый ОписаниеТипов("Строка",,,,КвалификаторНомера);

// Сформируем информацию о владельце
//-------------------------------------------------------------------------------------------------
	ВладСсылка = Телефония.ВладелецПолучить(Объект.Ссылка);
	Элементы.НадписьВладелец.Видимость = Ложь;

	Если (ЗначениеЗаполнено(ВладСсылка)) Тогда
		Темп = СокрЛП(ВладСсылка.ТочкаРазмещения);
		Темп = Темп + ", " + СокрЛП(ВладСсылка.Наименование);
		Элементы.НадписьВладелец.Заголовок = СокрЛП(Темп);
		Элементы.НадписьВладелец.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновлениеОтображения();
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеОтображения(Элемент = Неопределено)

// Видимость группы "ГруппаПараметры"
//-------------------------------------------------------------------------------------------------
	Доступно = (НЕ ЗначениеЗаполнено(Объект.Родитель));
	Элементы.ГруппаПараметры.Видимость = Доступно;
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Оповестить("Запись",Объект.Ссылка,ЭтаФорма);
	ПриСозданииНаСервере(Ложь,Истина);
	ПриОткрытии(Ложь);
КонецПроцедуры

//-------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура РодительНачалоВыбора(Элемент,ДанныеВыбора,СтандартнаяОбработка)

// Заполненный реквизит "Родитель" указывает на то, что текущий номер не является самостоятельным,
// а включен в серию телефонных номеров. Серия управляется номером, на который указывает Родитель
// Предоставим пользователю возможность выбрать Родителя для текущего номера
//-------------------------------------------------------------------------------------------------
	Форма = ПолучитьФорму("Справочник.ТелВнешние.ФормаВыбора",,Элемент);
	СтандартнаяОбработка = Ложь;

	ЭлементОтбора = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Родитель");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.НеЗаполнено;
	ЭлементОтбора.Использование		= Истина;

	ЭлементОтбора = Форма.Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.РежимОтображения	= РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	ЭлементОтбора.ЛевоеЗначение		= Новый ПолеКомпоновкиДанных("Код");
	ЭлементОтбора.ВидСравнения		= ВидСравненияКомпоновкиДанных.НеСодержит;
	ЭлементОтбора.ПравоеЗначение	= ВРег(СокрЛП(Объект.Код));
	ЭлементОтбора.Использование		= Истина;
	Форма.ОткрытьМодально();
КонецПроцедуры

&НаКлиенте
Процедура СписокВариантовПриИзменении(Элемент)

// Перенесем данные из списка значений в ТЧ "Варианты"
//-------------------------------------------------------------------------------------------------
	Объект.Варианты.Очистить();

	Для Каждого ТекСтрока Из ЭтаФорма.СписокВариантов Цикл
		Если (ЗначениеЗаполнено(ТекСтрока.Значение)) Тогда
			НовСтрока = Объект.Варианты.Добавить();
			НовСтрока.Код = ВРег(СокрЛП(ТекСтрока.Значение));
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура НадписьВладелецНажатие(Элемент)
	Попытка
		ВладСсылка = Телефония.ВладелецПолучить(Объект.Ссылка);
		ОткрытьЗначение(ВладСсылка);
	Исключение
	КонецПопытки;
КонецПроцедуры

//-------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура РаспределениеОчередьНачалоВыбора(Элемент,ДанныеВыбора,СтандартнаяОбработка)

// Предоставим пользователю выбор рекомендуемой очереди из тех, что расположены на сервере
// текущего выбранного в строке контакт-центра
//-------------------------------------------------------------------------------------------------
	Если (Элементы.Распределение.ТекущиеДанные <> Неопределено) Тогда
		ТекДанные = Элементы.Распределение.ТекущиеДанные;
		ТелОчередь = ЗначенияСервера.ПолучитьЗначениеРеквизита(ТекДанные.КонтактЦентр,"Очередь");
		ТелСервер = ЗначенияСервера.ПолучитьЗначениеРеквизита(ТелОчередь,"Сервер");

		Если (ЗначениеЗаполнено(ТелСервер)) Тогда
			МассивПараметров = Новый Массив();
			МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Сервер",ТелСервер));
			Элемент.ПараметрыВыбора = Новый ФиксированныйМассив(МассивПараметров);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
